# CanNotDeleteLastOpenView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ViewFailures..::..CanNotDeleteLastOpenView Property
BuiltInFailures..::..ViewFailures Class See Also
---
Deleting of all open views in a project is not allowed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CanNotDeleteLastOpenView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CanNotDeleteLastOpenView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CanNotDeleteLastOpenView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ViewFailures Class
Autodesk.Revit.DB Namespace